v1/app/controllers/raw_extractions_controller.rb

SELECT "raw_extractions".* FROM "raw_extractions" WHERE "raw_extractions"."user_id" = $1  [["user_id", 1]]
---
  def index
    if @user == User.anonymous
      @my_lists = @user.raw_extractions.select do |r|