v1/app/controllers/uploaded_lists_controller.rb

SELECT  "uploaded_lists".* FROM "uploaded_lists" WHERE "uploaded_lists"."lid" = $1 LIMIT 1  [["lid", 61]]
---
  def show_public
    @list = get_a_public_list(params[:id])
    if @list["list"]["is_list_public"]
      @uploaded_list = UploadedList.find_or_create(@list)